feat(core-backend): clean tests
